Таргетинг на погоду

Осень уже в самом разгаре --- а это значит, что нас всех ждут и дождливые, и тёплые дни. В дождь людям нужны зонты и дождевики, и производителям этих товаров крайне важно отслеживать рост интереса к ним. С другой стороны, производителям прохладительных напитков важны тёплые дни, когда на продвижение можно потратить бóльшие бюджеты.

Итак, владельцам рекламных объявлений определённых тематик требуется возможность управлять настройками показов в зависимости от погоды. В этой задаче вам потребуется реализовать простейшую версию этой функциональности --- таргетинг на температуру в определённые диапазоны дней.

В вашем распоряжении есть исторические данные о температуре, а также прогноз на ближайшее будущее. А именно:

    температура сегодня (этот день имеет номер 00);
    температура за прошедшие NN дней (вчерашний имеет номер −1−1, позавчерашний --- −2−2 и так далее до дня −N−N, самого раннего из известных);
    прогноз температуры на ближайшие NN дней (завтрашний имеет номер 11, послезавтрашний --- 22 и так далее до дня NN).

Кроме того, есть данные о настройках показа BB рекламных объявлений. Каждому из них соответствуют четыре числа tmintmin​, tmaxtmax​, dmindmin​, dmaxdmax​, означающие, что объявление можно показывать только в том случае, если за период от дня dmindmin​ до дня dmaxdmax​ включительно температура принимала или примет значение от tmintmin​ до tmaxtmax​ включительно. При этом гарантируется, что dmin≤0≤dmaxdmin​≤0≤dmax​, то есть диапазон дней должен включать сегодняшний.

Обратите внимание, что температура не дискретна! Например, если вчера значение температуры было −5−5, а сегодня −2−2, то необходимо считать, что в период, включающий сегодняшний и вчерашний дни, температура принимала не только значения −5−5 и −2−2, но и −4−4 и −3−3 (и даже −3,14−3,14, но в этой задаче все входные данные целочисленны).

Для каждого рекламного объявления определите, может ли оно быть показано в текущий день с учётом настроек и известных погодных данных.
Формат ввода

В первой строке входного файла вводится единственное целое неотрицательное число NN (N≤100 000N≤100000).

В следующей строке вводится 2N+12N+1 целых чисел --- значения температуры в дни −N−N, −N+1−N+1, ..., −1−1, 00, 11, ..., NN. Значения температуры по модулю не превосходят 109109.

В третьей строке содержится единственное целое положительное число BB (B≤100 000B≤100000) --- количество рекламных объявлений.

Наконец, в каждой из следующих BB строк содержатся 4 целых числа tmintmin​, tmaxtmax​, dmindmin​, dmaxdmax​, описывающие настройки соответствующего объявления. Гарантируется, что −109≤tmin≤tmax≤109−109≤tmin​≤tmax​≤109 и −N≤dmin≤0≤dmax≤N−N≤dmin​≤0≤dmax​≤N.
Формат вывода

Для каждого из объявлений выведите в отдельной строке «yes», если оно может быть показано согласно настройкам, и «no» в противном случае.
Пример
Ввод

2
2 4 5 -2 2
4
-1 -1 -1 1
0 10 -1 0
6 8 -2 2
3 3 -1 0

Вывод

yes
yes
no
no

Примечание

В задаче большой объем входных и выходных данных, для решения на Java используйте буферизированный ввод. Не используйте для чтения класс Scanner. Для вывода не используйте System.out.printf(), String.format(), используйте System.out.println() или OutputStreamWriter. Для буферизированного вывода не забывайте вызывать OutputStreamWriter.flush() перед выходом из приложения.
Ограничение памяти
256.0 Мб
Ограничение времени
3 с
Ввод
стандартный ввод или input.txt
Вывод
стандартный вывод или output.txt